BornaBiro/ESP32_WeatherPaper/Outdoor Unit Files/STM32 Code/Diplomski_Outdoor_Unit/myDrivers/Src/RF24.c
/*
 Copyright (C) 2011 J. Coliz <maniacbug@ymail.com>

 This program is free software; you can redistribute it and/or
 modify it under the terms of the GNU General Public License
 version 2 as published by the Free Software Foundation.
 */

#include "nRF24L01.h"
#include "RF24_config.h"
#include "RF24.h"

//uint8_t RF24_isValid()
//{
//  return ce_pin != 0xff && csn_pin != 0xff;
//}
/****************************************************************************/

void RF24_csn(uint8_t mode)
{
    HAL_GPIO_WritePin(csn_port, csn_pin, mode);
    HAL_Delay(1);
}

/****************************************************************************/

void RF24_ce(uint8_t level)
{
    HAL_GPIO_WritePin(ce_port, ce_pin, level);
    HAL_Delay(1);
}

/****************************************************************************/

void RF24_beginTransaction()
{
    //_SPI->beginTransaction(SPISettings(spi_speed, MSBFIRST, SPI_MODE0));
    RF24_csn(0);
}

/****************************************************************************/

void RF24_endTransaction()
{
    //_SPI->endTransaction();
    RF24_csn(1);
}

/****************************************************************************/

void RF24_read_registers(uint8_t reg, uint8_t* buf, uint8_t len)
{
    uint8_t _data = R_REGISTER | reg;
    RF24_beginTransaction();
    //status = _SPI->transfer(R_REGISTER | reg);
    HAL_SPI_TransmitReceive(&hspi1, &_data, &status, sizeof(uint8_t), 1000);
    //while (len--) {
    //    *buf++ = _SPI->transfer(0xFF);
    //}
    HAL_SPI_Transmit(&hspi1, buf, len, 1000);
    RF24_endTransaction();
}

/****************************************************************************/

uint8_t RF24_read_register(uint8_t reg)
{
    uint8_t result;
    uint8_t _dummyReg = 0xff;
    uint8_t _data = R_REGISTER | reg;
    RF24_beginTransaction();
    //status = _SPI->transfer(R_REGISTER | reg);
    //result = _SPI->transfer(0xff);

    HAL_SPI_TransmitReceive(&hspi1, &_data, &status, sizeof(uint8_t), 1000);
    HAL_SPI_TransmitReceive(&hspi1, &_dummyReg, &result, sizeof(uint8_t), 1000);
    RF24_endTransaction();

    return result;
}

/****************************************************************************/

void RF24_write_registers(uint8_t reg, const uint8_t* buf, uint8_t len)
{
    uint8_t _data = W_REGISTER | reg;
    RF24_beginTransaction();
    //status = _SPI->transfer(W_REGISTER | reg);
    HAL_SPI_TransmitReceive(&hspi1, &_data, &status, sizeof(uint8_t), 1000);
    //while (len--) {
    //    _SPI->transfer(*buf++);
    //}
    HAL_SPI_Transmit(&hspi1, (uint8_t*)buf, len, 1000);
    RF24_endTransaction();
}

/****************************************************************************/

void RF24_write_register(uint8_t reg, uint8_t value, uint8_t is_cmd_only)
{
    uint8_t _data = W_REGISTER | reg;
    uint8_t _dummyReg;
    if (is_cmd_only) {
        RF24_beginTransaction();
    //    status = _SPI->transfer(W_REGISTER | reg);
        HAL_SPI_TransmitReceive(&hspi1, &_data, &status, sizeof(uint8_t), 1000);
        RF24_endTransaction();
    }
    else {
        RF24_beginTransaction();
    //    status = _SPI->transfer(W_REGISTER | reg);
    //    _SPI->transfer(value);
        HAL_SPI_TransmitReceive(&hspi1, &_data, &status, sizeof(uint8_t), 1000);
        HAL_SPI_TransmitReceive(&hspi1, &value, &_dummyReg, sizeof(uint8_t), 1000);
        RF24_endTransaction();
    }
}

/****************************************************************************/

void RF24_write_payload(const void* buf, uint8_t data_len, const uint8_t writeType)
{
    const uint8_t* current = (const uint8_t*)(buf);
    uint8_t _dummyReg[32];
    memset(_dummyReg, 0, 32);

    uint8_t blank_len = !data_len ? 1 : 0;
    if (!dynamic_payloads_enabled) {
        data_len = rf24_min(data_len, payload_size);
        blank_len = payload_size - data_len;
    }
    else {
        data_len = rf24_min(data_len, 32);
    }

    RF24_beginTransaction();
    //status = _SPI->transfer(writeType);
    HAL_SPI_TransmitReceive(&hspi1, (uint8_t*)&writeType, &status, sizeof(uint8_t), 1000);
    //while (data_len--) {
    //    _SPI->transfer(*current++);
    //}
    HAL_SPI_Transmit(&hspi1, (uint8_t*)current, data_len, 1000);
    //while (blank_len--) {
    //    _SPI->transfer(0);
    //}
    HAL_SPI_Transmit(&hspi1, _dummyReg, blank_len, 1000);
    RF24_endTransaction();
}

/****************************************************************************/

void RF24_read_payload(void* buf, uint8_t data_len)
{
    uint8_t* current = (uint8_t*)(buf);
    uint8_t _dummyReg[32];
    uint8_t _reg;

    uint8_t blank_len = 0;
    if (!dynamic_payloads_enabled) {
        data_len = rf24_min(data_len, payload_size);
        blank_len = payload_size - data_len;
    }
    else {
        data_len = rf24_min(data_len, 32);
    }

    RF24_beginTransaction();
    //status = _SPI->transfer(R_RX_PAYLOAD);
    _reg = R_RX_PAYLOAD;
    HAL_SPI_TransmitReceive(&hspi1, &_reg, &status, sizeof(uint8_t), 1000);
    //while (data_len--) {
    //    *current++ = _SPI->transfer(0xFF);
    //}
    HAL_SPI_Receive(&hspi1, current, data_len, 1000);
    //while (blank_len--) {
    //    _SPI->transfer(0xff);
    //}
    HAL_SPI_Receive(&hspi1, _dummyReg, blank_len, 1000);
    RF24_endTransaction();
}

/****************************************************************************/

uint8_t RF24_flush_rx(void)
{
    RF24_write_register(FLUSH_RX, RF24_NOP, 1);
    return status;
}

/****************************************************************************/

uint8_t RF24_flush_tx(void)
{
    RF24_write_register(FLUSH_TX, RF24_NOP, 1);
    return status;
}

/****************************************************************************/

uint8_t RF24_get_status(void)
{
    RF24_write_register(RF24_NOP, RF24_NOP, 1);
    return status;
}

/****************************************************************************/

void RF24_init(GPIO_TypeDef* _ce_port, uint16_t _ce_pin, GPIO_TypeDef* _cs_port, uint16_t _cs_pin)
{
    ce_port = _ce_port;
    ce_pin = _ce_pin;
    csn_port = _cs_port;
    csn_pin = _cs_pin;
    payload_size = 32;
    dynamic_payloads_enabled = 1;
    addr_width = 5;
    _is_p_variant = 0;
    csDelay = 5;
    pipe0_reading_address[0] = 0;
}

