BornaBiro/ESP32_WeatherPaper/Outdoor Unit Files/STM32 Code/Diplomski_Outdoor_Unit/myDrivers/Src/RF24.c
/****************************************************************************/

void RF24_setChannel(uint8_t channel)
{
    const uint8_t max_channel = 125;
    RF24_write_register(RF_CH, rf24_min(channel, max_channel), 0);
}

uint8_t RF24_getChannel()
{

    return RF24_read_register(RF_CH);
}

/****************************************************************************/

void RF24_setPayloadSize(uint8_t size)
{
    // payload size must be in range [1, 32]
    payload_size = rf24_max(1, rf24_min(32, size));

    // write static payload size setting for all pipes
    for (uint8_t i = 0; i < 6; ++i)
        RF24_write_register(RX_PW_P0 + i, payload_size, 0);
}

/****************************************************************************/

uint8_t RF24_getPayloadSize(void)
{
    return payload_size;
}

/****************************************************************************/

uint8_t RF24_begin()
{
    RF24_ce(0);
    RF24_csn(1);

    // Must allow the radio time to settle else configuration bits will not necessarily stick.
    // This is actually only required following power up but some settling time also appears to
    // be required after resets too. For full coverage, we'll always assume the worst.
    // Enabling 16b CRC is by far the most obvious case if the wrong timing is used - or skipped.
    // Technically we require 4.5ms + 14us as a worst case. We'll just call it 5ms for good measure.
    // WARNING: Delay is based on P-variant whereby non-P *may* require different timing.
    HAL_Delay(5);

    // Set 1500uS (minimum for 32B payload in ESB@250KBPS) timeouts, to make testing a little easier
    // WARNING: If this is ever lowered, either 250KBS mode with AA is broken or maximum packet
    // sizes must never be used. See datasheet for a more complete explanation.
    RF24_setRetries(5, 15);

    // Then set the data rate to the slowest (and most reliable) speed supported by all
    // hardware.
    RF24_setDataRate(RF24_1MBPS);

    // detect if is a plus variant & use old toggle features command accordingly
    uint8_t before_toggle = RF24_read_register(FEATURE);
    RF24_toggle_features();
    uint8_t after_toggle = RF24_read_register(FEATURE);
    _is_p_variant = before_toggle == after_toggle;
    if (after_toggle){
        if (_is_p_variant){
            // module did not experience power-on-reset (#401)
            RF24_toggle_features();
        }
        // allow use of multicast parameter and dynamic payloads by default
        RF24_write_register(FEATURE, 0, 0);
    }
    ack_payloads_enabled = 0;     // ack payloads disabled by default
    RF24_write_register(DYNPD, 0, 0);         // disable dynamic payloads by default (for all pipes)
    dynamic_payloads_enabled = 0;
    RF24_write_register(EN_AA, 0x3F, 0);      // enable auto-ack on all pipes
    RF24_write_register(EN_RXADDR, 0, 0);     // close all RX pipes
    RF24_setPayloadSize(32);               // set static payload size to 32 (max) bytes by default
    RF24_setAddressWidth(5);               // set default address length to (max) 5 bytes

    // Set up default configuration.  Callers can always change it later.
    // This channel should be universally safe and not bleed over into adjacent
    // spectrum.
    RF24_setChannel(76);

    // Reset current status
    // Notice reset and flush is the last thing we do
    RF24_write_register(NRF_STATUS, _BV(RX_DR) | _BV(TX_DS) | _BV(MAX_RT), 0);


    // Flush buffers
    RF24_flush_rx();
    RF24_flush_tx();

    // Clear CONFIG register:
    //      Reflect all IRQ events on IRQ pin
    //      Enable PTX
    //      Power Up
    //      16-bit CRC (CRC required by auto-ack)
    // Do not write CE high so radio will remain in standby I mode
    // PTX should use only 22uA of power
    RF24_write_register(NRF_CONFIG, (_BV(EN_CRC) | _BV(CRCO)), 0);
    config_reg = RF24_read_register(NRF_CONFIG);

    RF24_powerUp();

    // if config is not set correctly then there was a bad response from module
    return config_reg == (_BV(EN_CRC) | _BV(CRCO) | _BV(PWR_UP)) ? 1 : 0;
}

/****************************************************************************/

uint8_t RF24_isChipConnected()
{
    uint8_t setup = RF24_read_register(SETUP_AW);
    if (setup >= 1 && setup <= 3) {
        return 1;
    }

    return 0;
}

/****************************************************************************/

void RF24_startListening(void)
{
    config_reg |= _BV(PRIM_RX);
    RF24_write_register(NRF_CONFIG, config_reg, 0);
    RF24_write_register(NRF_STATUS, _BV(RX_DR) | _BV(TX_DS) | _BV(MAX_RT), 0);
    RF24_ce(1);

    // Restore the pipe0 address, if exists
    if (pipe0_reading_address[0] > 0) {
        RF24_write_registers(RX_ADDR_P0, pipe0_reading_address, addr_width);
    } else {
        RF24_closeReadingPipe(0);
    }
}

/****************************************************************************/
static const uint8_t child_pipe_enable[] = {ERX_P0, ERX_P1, ERX_P2,
                                                    ERX_P3, ERX_P4, ERX_P5};

void RF24_stopListening(void)
{
    RF24_ce(0);

    //delayMicroseconds(100);
    //delayMicroseconds(txDelay);
    HAL_Delay(1);
    if (ack_payloads_enabled){
        RF24_flush_tx();
    }

    config_reg &= ~_BV(PRIM_RX);
    RF24_write_register(NRF_CONFIG, config_reg, 0);

    RF24_write_register(EN_RXADDR, RF24_read_register(EN_RXADDR) | _BV(child_pipe_enable[0]), 0); // Enable RX on pipe0
}

/****************************************************************************/

void RF24_powerDown(void)
{
    RF24_ce(0); // Guarantee CE is low on powerDown
    config_reg &= ~_BV(PWR_UP);
    RF24_write_register(NRF_CONFIG, config_reg, 0);
}

/****************************************************************************/

//Power up now. Radio will not power down unless instructed by MCU for config changes etc.
void RF24_powerUp(void)
{
    // if not powered up then power up and wait for the radio to initialize
    if (!(config_reg & _BV(PWR_UP))) {
        config_reg |= _BV(PWR_UP);
        RF24_write_register(NRF_CONFIG, config_reg, 0);

        // For nRF24L01+ to go from power down mode to TX or RX mode it must first pass through stand-by mode.
        // There must be a delay of Tpd2stby (see Table 16.) after the nRF24L01+ leaves power down mode before
        // the CEis set high. - Tpd2stby can be up to 5ms per the 1.0 datasheet
        //delayMicroseconds(RF24_POWERUP_DELAY);
        HAL_Delay(1);
    }
}

/******************************************************************/
void RF24_errNotify()
{

