BornaBiro/ESP32_WeatherPaper/Outdoor Unit Files/STM32 Code/Diplomski_Outdoor_Unit/myDrivers/Src/RF24.c
}
/******************************************************************/

//Similar to the previous write, clears the interrupt flags
uint8_t RF24_write(const void* buf, uint8_t len, const uint8_t multicast)
{
    //Start Writing
    RF24_startFastWrite(buf, len, multicast, 1);

    //Wait until complete or failed
    #if defined(FAILURE_HANDLING) || defined(RF24_LINUX)
    uint32_t timer = HAL_GetTick();
    #endif // defined(FAILURE_HANDLING) || defined(RF24_LINUX)

    while (!(RF24_get_status() & (_BV(TX_DS) | _BV(MAX_RT)))) {
        #if defined(FAILURE_HANDLING) || defined(RF24_LINUX)
        if (HAL_GetTick() - timer > 95) {
            RF24_errNotify();
            #if defined(FAILURE_HANDLING)
            return 0;
            #else
            HAL_Delay(100);
            #endif
        }
        #endif
    }

    RF24_ce(0);

    RF24_write_register(NRF_STATUS, _BV(RX_DR) | _BV(TX_DS) | _BV(MAX_RT), 0);

    //Max retries exceeded
    if (status & _BV(MAX_RT)) {
        RF24_flush_tx(); // Only going to be 1 packet in the FIFO at a time using this method, so just flush
        return 0;
    }
    //TX OK 1 or 0
    return 1;
}

//uint8_t RF24_write(const void* buf, uint8_t len)
//{
//    return RF24_write(buf, len, 0);
//}
/****************************************************************************/

//For general use, the interrupt flags are not important to clear
uint8_t RF24_writeBlocking(const void* buf, uint8_t len, uint32_t timeout)
{
    //Block until the FIFO is NOT full.
    //Keep track of the MAX retries and set auto-retry if seeing failures
    //This way the FIFO will fill up and allow blocking until packets go through
    //The radio will auto-clear everything in the FIFO as long as CE remains high

    uint32_t timer = HAL_GetTick();                               // Get the time that the payload transmission started

    while ((RF24_get_status() & (_BV(TX_FULL)))) {                // Blocking only if FIFO is full. This will loop and block until TX is successful or timeout

        if (status & _BV(MAX_RT)) {                          // If MAX Retries have been reached
            RF24_reUseTX();                                       // Set re-transmit and clear the MAX_RT interrupt flag
            if (HAL_GetTick() - timer > timeout) {
                return 0;                                    // If this payload has exceeded the user-defined timeout, exit and return 0
            }
        }
        #if defined(FAILURE_HANDLING) || defined(RF24_LINUX)
        if (HAL_GetTick() - timer > (timeout + 95)) {
            RF24_errNotify();
            #if defined(FAILURE_HANDLING)
            return 0;
            #endif
        }
        #endif

    }

    //Start Writing
    RF24_startFastWrite(buf, len, 0, 1);                             // Write the payload if a buffer is clear

    return 1;                                                // Return 1 to indicate successful transmission
}

/****************************************************************************/

void RF24_reUseTX()
{
    RF24_write_register(NRF_STATUS, _BV(MAX_RT), 0);  //Clear max retry flag
    RF24_write_register(REUSE_TX_PL, RF24_NOP, 1);
    RF24_ce(0);                                  //Re-Transfer packet
    RF24_ce(1);
}

/****************************************************************************/

uint8_t RF24_writeFast(const void* buf, uint8_t len, const uint8_t multicast)
{
    //Block until the FIFO is NOT full.
    //Keep track of the MAX retries and set auto-retry if seeing failures
    //Return 0 so the user can control the retrys and set a timer or failure counter if required
    //The radio will auto-clear everything in the FIFO as long as CE remains high

    #if defined(FAILURE_HANDLING) || defined(RF24_LINUX)
    uint32_t timer = HAL_GetTick();
    #endif

    //Blocking only if FIFO is full. This will loop and block until TX is successful or fail
    while ((RF24_get_status() & (_BV(TX_FULL)))) {
        if (status & _BV(MAX_RT)) {
            return 0;                                        //Return 0. The previous payload has not been retransmitted
            // From the user perspective, if you get a 0, just keep trying to send the same payload
        }
        #if defined(FAILURE_HANDLING) || defined(RF24_LINUX)
        if (HAL_GetTick() - timer > 95) {
            RF24_errNotify();
            #if defined(FAILURE_HANDLING)
            return 0;
            #endif // defined(FAILURE_HANDLING)
        }
        #endif
    }
    RF24_startFastWrite(buf, len, multicast, 1);                     // Start Writing

    return 1;
}

//uint8_t RF24_writeFast(const void* buf, uint8_t len)
//{
//    return RF24_writeFast(buf, len, 0);
//}

/****************************************************************************/

//Per the documentation, we want to set PTX Mode when not listening. Then all we do is write data and set CE high
//In this mode, if we can keep the FIFO buffers loaded, packets will transmit immediately (no 130us delay)
//Otherwise we enter Standby-II mode, which is still faster than standby mode
//Also, we remove the need to keep writing the config register over and over and delaying for 150 us each time if sending a stream of data

void RF24_startFastWrite(const void* buf, uint8_t len, const uint8_t multicast, uint8_t startTx)
{ //TMRh20

    RF24_write_payload(buf, len, multicast ? W_TX_PAYLOAD_NO_ACK : W_TX_PAYLOAD);
    if (startTx) {
        RF24_ce(1);
    }
}

/****************************************************************************/

//Added the original startWrite back in so users can still use interrupts, ack payloads, etc
//Allows the library to pass all tests
uint8_t RF24_startWrite(const void* buf, uint8_t len, const uint8_t multicast)
{

    // Send the payload
    RF24_write_payload(buf, len, multicast ? W_TX_PAYLOAD_NO_ACK : W_TX_PAYLOAD);
    RF24_ce(1);
    //delayMicroseconds(10);
    HAL_Delay(1);
    RF24_ce(0);
    return !(status & _BV(TX_FULL));
}

