BornaBiro/ESP32_WeatherPaper/Outdoor Unit Files/STM32 Code/Diplomski_Outdoor_Unit/myDrivers/Src/RF24.c
/****************************************************************************/

uint8_t RF24_rxFifoFull()
{
    return RF24_read_register(FIFO_STATUS) & _BV(RX_FULL);
}

/****************************************************************************/

uint8_t RF24_txStandBy()
{

    #if defined(FAILURE_HANDLING) || defined(RF24_LINUX)
    uint32_t timeout = HAL_GetTick();
    #endif
    while (!(RF24_read_register(FIFO_STATUS) & _BV(TX_EMPTY))) {
        if (status & _BV(MAX_RT)) {
            RF24_write_register(NRF_STATUS, _BV(MAX_RT), 0);
            RF24_ce(0);
            RF24_flush_tx();    //Non blocking, flush the data
            return 0;
        }
        #if defined(FAILURE_HANDLING) || defined(RF24_LINUX)
        if (HAL_GetTick() - timeout > 95) {
            RF24_errNotify();
            #if defined(FAILURE_HANDLING)
            return 0;
            #endif
        }
        #endif
    }

    RF24_ce(0);               //Set STANDBY-I mode
    return 1;
}

/****************************************************************************/

uint8_t RF24_txStandByT(uint32_t timeout, uint8_t startTx)
{

    if (startTx) {
        RF24_stopListening();
        RF24_ce(1);
    }
    uint32_t start = HAL_GetTick();

    while (!(RF24_read_register(FIFO_STATUS) & _BV(TX_EMPTY))) {
        if (status & _BV(MAX_RT)) {
            RF24_write_register(NRF_STATUS, _BV(MAX_RT), 0);
            RF24_ce(0); // Set re-transmit
            RF24_ce(1);
            if (HAL_GetTick() - start >= timeout) {
                RF24_ce(0);
                RF24_flush_tx();
                return 0;
            }
        }
        #if defined(FAILURE_HANDLING) || defined(RF24_LINUX)
        if (HAL_GetTick() - start > (timeout + 95)) {
            RF24_errNotify();
            #if defined(FAILURE_HANDLING)
            return 0;
            #endif
        }
        #endif
    }

    RF24_ce(0);  //Set STANDBY-I mode
    return 1;

}

/****************************************************************************/

void RF24_maskIRQ(uint8_t tx, uint8_t fail, uint8_t rx)
{
    /* clear the interrupt flags */
    config_reg &= ~(1 << MASK_MAX_RT | 1 << MASK_TX_DS | 1 << MASK_RX_DR);
    /* set the specified interrupt flags */
    config_reg |= fail << MASK_MAX_RT | tx << MASK_TX_DS | rx << MASK_RX_DR;
    RF24_write_register(NRF_CONFIG, config_reg, 0);
}

/****************************************************************************/

uint8_t RF24_getDynamicPayloadSize(void)
{
    uint8_t result = RF24_read_register(R_RX_PL_WID);

    if (result > 32) {
        RF24_flush_rx();
        HAL_Delay(2);
        return 0;
    }
    return result;
}

/****************************************************************************/

//uint8_t RF24_available(void)
//{
//    return available(NULL);
//}

/****************************************************************************/

uint8_t RF24_available(uint8_t* pipe_num)
{
    // get implied RX FIFO empty flag from status byte
    uint8_t pipe = (RF24_get_status() >> RX_P_NO) & 0x07;
    if (pipe > 5)
        return 0;

    // If the caller wants the pipe number, include that
    if (pipe_num)
        *pipe_num = pipe;

    return 1;
}

/****************************************************************************/

void RF24_read(void* buf, uint8_t len)
{

    // Fetch the payload
    RF24_read_payload(buf, len);

    //Clear the only applicable interrupt flags
    RF24_write_register(NRF_STATUS, _BV(RX_DR), 0);

}

/****************************************************************************/

void RF24_whatHappened(uint8_t *tx_ok, uint8_t *tx_fail, uint8_t *rx_ready)
{
    // Read the status & reset the status in one easy call
    // Or is that such a good idea?
    RF24_write_register(NRF_STATUS, _BV(RX_DR) | _BV(TX_DS) | _BV(MAX_RT), 0);

    // Report to the user what happened
    *tx_ok = status & _BV(TX_DS);
    *tx_fail = status & _BV(MAX_RT);
    *rx_ready = status & _BV(RX_DR);
}

/****************************************************************************/

void RF24_openWritingPipe(uint64_t value)
{
    // Note that AVR 8-bit uC's store this LSB first, and the NRF24L01(+)
    // expects it LSB first too, so we're good.

    RF24_write_registers(RX_ADDR_P0, (uint8_t*)(&value), addr_width);
    RF24_write_registers(TX_ADDR, (uint8_t*)(&value), addr_width);
}

/****************************************************************************/
//void RF24_openWritingPipe(const uint8_t* address)
//{
    // Note that AVR 8-bit uC's store this LSB first, and the NRF24L01(+)
    // expects it LSB first too, so we're good.
//    RF24_write_registers(RX_ADDR_P0, address, addr_width);
//    RF24_write_registers(TX_ADDR, address, addr_width);
//}

/****************************************************************************/
const uint8_t child_pipe[] = {RX_ADDR_P0, RX_ADDR_P1, RX_ADDR_P2,
                                             RX_ADDR_P3, RX_ADDR_P4, RX_ADDR_P5};

void RF24_openReadingPipe(uint8_t child, uint64_t address)
{
    // If this is pipe 0, cache the address.  This is needed because
    // openWritingPipe() will overwrite the pipe 0 address, so
    // startListening() will have to restore it.
    if (child == 0) {
        memcpy(pipe0_reading_address, &address, addr_width);
    }

    if (child <= 5) {
        // For pipes 2-5, only write the LSB
        if (child < 2) {
            RF24_write_registers(child_pipe[child], (const uint8_t*)(&address), addr_width);
        } else {
            RF24_write_registers(child_pipe[child], (const uint8_t*)(&address), 1);
        }

        // Note it would be more efficient to set all of the bits for all open
        // pipes at once.  However, I thought it would make the calling code
        // more simple to do it this way.
        RF24_write_register(EN_RXADDR, RF24_read_register(EN_RXADDR) | _BV(child_pipe_enable[child]), 0);
    }
}

/****************************************************************************/
void RF24_setAddressWidth(uint8_t a_width)
{

