BornaBiro/ESP32_WeatherPaper/Outdoor Unit Files/STM32 Code/Diplomski_Outdoor_Unit/myDrivers/Src/RF24.c
    if (a_width -= 2) {
        RF24_write_register(SETUP_AW, a_width % 4, 0);
        addr_width = (a_width % 4) + 2;
    } else {
        RF24_write_register(SETUP_AW, 0, 0);
        addr_width = 2;
    }

}

/****************************************************************************/

void RF24openReadingPipe(uint8_t child, const uint8_t* address)
{
    // If this is pipe 0, cache the address.  This is needed because
    // openWritingPipe() will overwrite the pipe 0 address, so
    // startListening() will have to restore it.
    if (child == 0) {
        memcpy(pipe0_reading_address, address, addr_width);
    }
    if (child <= 5) {
        // For pipes 2-5, only write the LSB
        if (child < 2) {
            RF24_write_registers(child_pipe[child], address, addr_width);
        } else {
            RF24_write_registers(child_pipe[child], address, 1);
        }

        // Note it would be more efficient to set all of the bits for all open
        // pipes at once.  However, I thought it would make the calling code
        // more simple to do it this way.
        RF24_write_register(EN_RXADDR, RF24_read_register(EN_RXADDR) | _BV(child_pipe_enable[child]), 0);

    }
}

/****************************************************************************/

void RF24_closeReadingPipe(uint8_t pipe)
{
    RF24_write_register(EN_RXADDR, RF24_read_register(EN_RXADDR) & ~_BV(child_pipe_enable[pipe]), 0);
}

/****************************************************************************/

void RF24_toggle_features(void)
{
    uint8_t _data = ACTIVATE;
    RF24_beginTransaction();
    //status = _SPI->transfer(ACTIVATE);
    //_SPI->transfer(0x73);
    HAL_SPI_TransmitReceive(&hspi1, &_data, &status, sizeof(uint8_t), 1000);
    _data = 0x73;
    HAL_SPI_Transmit(&hspi1, &_data, sizeof(uint8_t), 1000);
    RF24_endTransaction();
}

/****************************************************************************/

void RF24_enableDynamicPayloads(void)
{
    // Enable dynamic payload throughout the system

    //toggle_features();
    RF24_write_register(FEATURE, RF24_read_register(FEATURE) | _BV(EN_DPL), 0);

    // Enable dynamic payload on all pipes
    //
    // Not sure the use case of only having dynamic payload on certain
    // pipes, so the library does not support it.
    RF24_write_register(DYNPD, RF24_read_register(DYNPD) | _BV(DPL_P5) | _BV(DPL_P4) | _BV(DPL_P3) | _BV(DPL_P2) | _BV(DPL_P1) | _BV(DPL_P0), 0);

    dynamic_payloads_enabled = 1;
}

/****************************************************************************/
void RF24_disableDynamicPayloads(void)
{
    // Disables dynamic payload throughout the system.  Also disables Ack Payloads

    //toggle_features();
    RF24_write_register(FEATURE, 0, 0);

    // Disable dynamic payload on all pipes
    //
    // Not sure the use case of only having dynamic payload on certain
    // pipes, so the library does not support it.
    RF24_write_register(DYNPD, 0, 0);

    dynamic_payloads_enabled = 0;
    ack_payloads_enabled = 0;
}

/****************************************************************************/

void RF24_enableAckPayload(void)
{
    // enable ack payloads and dynamic payload features

    if (!ack_payloads_enabled){
        RF24_write_register(FEATURE, RF24_read_register(FEATURE) | _BV(EN_ACK_PAY) | _BV(EN_DPL), 0);

        // Enable dynamic payload on pipes 0
        RF24_write_register(DYNPD, RF24_read_register(DYNPD) | _BV(DPL_P1) | _BV(DPL_P0), 0);
        dynamic_payloads_enabled = 1;
        ack_payloads_enabled = 1;
    }
}

/****************************************************************************/

void RF24_disableAckPayload(void)
{
    // disable ack payloads (leave dynamic payload features as is)
    if (ack_payloads_enabled){
        RF24_write_register(FEATURE, RF24_read_register(FEATURE) | ~_BV(EN_ACK_PAY), 0);

        ack_payloads_enabled = 0;
    }
}

/****************************************************************************/

void RF24_enableDynamicAck(void)
{
    //
    // enable dynamic ack features
    //
    //toggle_features();
    RF24_write_register(FEATURE, RF24_read_register(FEATURE) | _BV(EN_DYN_ACK), 0);
}

/****************************************************************************/

uint8_t RF24_writeAckPayload(uint8_t pipe, const void* buf, uint8_t len)
{
    if (ack_payloads_enabled){
        const uint8_t* current = (const uint8_t*)(buf);

        RF24_write_payload(current, len, W_ACK_PAYLOAD | (pipe & 0x07));
        return !(status & _BV(TX_FULL));
    }
    return 0;
}

/****************************************************************************/

uint8_t RF24_isAckPayloadAvailable(void)
{
    return RF24_available(NULL);
}

/****************************************************************************/

uint8_t RF24_isPVariant(void)
{
    return _is_p_variant;
}

/****************************************************************************/

void RF24_setAutoAck(uint8_t enable)
{
    if (enable){
        RF24_write_register(EN_AA, 0x3F, 0);
    }else{
        RF24_write_register(EN_AA, 0, 0);
        // accomodate ACK payloads feature
        if (ack_payloads_enabled){
            RF24_disableAckPayload();
        }
    }
}

/****************************************************************************/

//void RF24_setAutoAck(uint8_t pipe, bool enable)
//{
//    if (pipe < 6) {
//        uint8_t en_aa = RF24_read_register(EN_AA);
//        if (enable) {
//            en_aa |= _BV(pipe);
//        }else{
//            en_aa &= ~_BV(pipe);
//            if (ack_payloads_enabled && !pipe){
//                RF24_disableAckPayload();
//            }
//        }
//        RF24_write_register(EN_AA, en_aa, 0);
//    }
//}

/****************************************************************************/

uint8_t RF24_testCarrier(void)
{
    return (RF24_read_register(CD) & 1);
}

/****************************************************************************/

uint8_t RF24_testRPD(void)
{
    return (RF24_read_register(RPD) & 1);
}

