BornaBiro/ESP32_WeatherPaper/Outdoor Unit Files/STM32 Code/Diplomski_Outdoor_Unit/myDrivers/Src/RF24.c
/****************************************************************************/

void RF24_setPALevel(uint8_t level, uint8_t lnaEnable)
{

    uint8_t setup = RF24_read_register(RF_SETUP) & 0xF8;

    if (level > 3) {                            // If invalid level, go to max PA
        level = (RF24_PA_MAX << 1) + lnaEnable; // +1 to support the SI24R1 chip extra bit
    } else {
        level = (level << 1) + lnaEnable;       // Else set level as requested
    }

    RF24_write_register(RF_SETUP, setup |= level, 0);   // Write it to the chip
}

/****************************************************************************/

uint8_t RF24_getPALevel(void)
{

    return (RF24_read_register(RF_SETUP) & (_BV(RF_PWR_LOW) | _BV(RF_PWR_HIGH))) >> 1;
}

/****************************************************************************/

uint8_t RF24_getARC(void)
{

    return RF24_read_register(OBSERVE_TX) & 0x0F;
}

/****************************************************************************/

uint8_t RF24_setDataRate(rf24_datarate_e speed)
{
    uint8_t result = 0;
    uint8_t setup = RF24_read_register(RF_SETUP);

    // HIGH and LOW '00' is 1Mbs - our default
    setup &= ~(_BV(RF_DR_LOW) | _BV(RF_DR_HIGH));
    txDelay = 280;
    if (speed == RF24_250KBPS) {
        // Must set the RF_DR_LOW to 1; RF_DR_HIGH (used to be RF_DR) is already 0
        // Making it '10'.
        setup |= _BV(RF_DR_LOW);
        txDelay = 505;
    } else {
        // Set 2Mbs, RF_DR (RF_DR_HIGH) is set 1
        // Making it '01'
        if (speed == RF24_2MBPS) {
            setup |= _BV(RF_DR_HIGH);
            txDelay = 240;
        }
    }
    RF24_write_register(RF_SETUP, setup, 0);

    // Verify our result
    if (RF24_read_register(RF_SETUP) == setup) {
        result = 1;
    }
    return result;
}

/****************************************************************************/

rf24_datarate_e RF24_getDataRate(void)
{
    rf24_datarate_e result;
    uint8_t dr = RF24_read_register(RF_SETUP) & (_BV(RF_DR_LOW) | _BV(RF_DR_HIGH));

    // switch uses RAM (evil!)
    // Order matters in our case below
    if (dr == _BV(RF_DR_LOW)) {
        // '10' = 250KBPS
        result = RF24_250KBPS;
    } else if (dr == _BV(RF_DR_HIGH)) {
        // '01' = 2MBPS
        result = RF24_2MBPS;
    } else {
        // '00' = 1MBPS
        result = RF24_1MBPS;
    }
    return result;
}

/****************************************************************************/

void RF24_setCRCLength(rf24_crclength_e length)
{
    config_reg &= ~(_BV(CRCO) | _BV(EN_CRC));

    // switch uses RAM (evil!)
    if (length == RF24_CRC_DISABLED) {
        // Do nothing, we turned it off above.
    } else if (length == RF24_CRC_8) {
        config_reg |= _BV(EN_CRC);
    } else {
        config_reg |= _BV(EN_CRC);
        config_reg |= _BV(CRCO);
    }
    RF24_write_register(NRF_CONFIG, config_reg, 0);
}

/****************************************************************************/

rf24_crclength_e RF24_getCRCLength(void)
{
    rf24_crclength_e result = RF24_CRC_DISABLED;
    uint8_t AA = RF24_read_register(EN_AA);
    config_reg = RF24_read_register(NRF_CONFIG);

    if (config_reg & _BV(EN_CRC) || AA) {
        if (config_reg & _BV(CRCO)) {
            result = RF24_CRC_16;
        } else {
            result = RF24_CRC_8;
        }
    }

    return result;
}

/****************************************************************************/

void RF24_disableCRC(void)
{
    config_reg &= ~_BV(EN_CRC);
    RF24_write_register(NRF_CONFIG, config_reg, 0);
}

/****************************************************************************/
void RF24_setRetries(uint8_t delay, uint8_t count)
{
    RF24_write_register(SETUP_RETR, (delay & 0xf) << ARD | (count & 0xf) << ARC, 0);
}

/****************************************************************************/
void RF24_startConstCarrier(rf24_pa_dbm_e level, uint8_t channel)
{
    RF24_stopListening();
    RF24_write_register(RF_SETUP, RF24_read_register(RF_SETUP) | _BV(CONT_WAVE) | _BV(PLL_LOCK), 0);
    if (RF24_isPVariant()){
        RF24_setAutoAck(0);
        RF24_setRetries(0, 0);
        uint8_t dummy_buf[32];
        for (uint8_t i = 0; i < 32; ++i)
            dummy_buf[i] = 0xFF;

        // use write_register() instead of openWritingPipe() to bypass
        // truncation of the address with the current RF24::addr_width value
        RF24_write_registers(TX_ADDR, (uint8_t*)(&dummy_buf), 5);
        RF24_flush_tx();  // so we can write to top level

        // use write_register() instead of write_payload() to bypass
        // truncation of the payload with the current RF24::payload_size value
        RF24_write_registers(W_TX_PAYLOAD, (const uint8_t*)(&dummy_buf), 32);

        RF24_disableCRC();
    }
    RF24_setPALevel(level, 1);
    RF24_setChannel(channel);
    RF24_ce(1);
    if (RF24_isPVariant()){
        HAL_Delay(1); // datasheet says 1 ms is ok in this instance
        RF24_ce(0);
        RF24_reUseTX();
    }
}

/****************************************************************************/
void RF24_stopConstCarrier()
{
    /*
     * A note from the datasheet:
     * Do not use REUSE_TX_PL together with CONT_WAVE=1. When both these
     * registers are set the chip does not react when setting CE low. If
     * however, both registers are set PWR_UP = 0 will turn TX mode off.
     */
    RF24_powerDown();  // per datasheet recommendation (just to be safe)
    RF24_write_register(RF_SETUP, RF24_read_register(RF_SETUP) & ~_BV(CONT_WAVE) & ~_BV(PLL_LOCK), 0);
    RF24_ce(0);
}
